toy_tale_api/app/controllers/api/v1/toys_controller.rb

    def create
        @toy = Api::V1::Toy.create(toy_params)
        @toy.likes = 0
        @toy.save
---
INSERT INTO "api_v1_toys" ("name", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["image", "123"], ["created_at", "2020-11-19 13:41:59.565629"], ["updated_at", "2020-11-19 13:41:59.565629"]]
UPDATE "api_v1_toys" SET "likes" = ?, "updated_at" = ? WHERE "api_v1_toys"."id" = ?  [["likes", 5], ["updated_at", "2020-11-19 13:07:29.066107"], ["id", 4]]

    def update
        @toy = Api::V1::Toy.find_by_id(params[:id])
        @toy.update(likes: @toy.likes + 1)
---
UPDATE "api_v1_toys" SET "likes" = ?, "updated_at" = ? WHERE "api_v1_toys"."id" = ?  [["likes", 1], ["updated_at", "2020-11-19 13:44:25.112317"], ["id", 11]]